tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k90_tdd.h
#define C4TSEL0                       522
#define C4TSEL1                       523
#define C5TSEL0                       524
#define C6TSEL0                       525
#define C7TSEL                        526
#define C7TSEL0                       527
#define C7TSEL1                       528
#define CCPTMRS0                      529
#define C1TSEL0                       530
#define C1TSEL                        531
#define C1TSEL1                       532
#define C1TSEL2                       533
#define C2TSEL0                       534
#define C2TSEL                        535
#define C2TSEL1                       536
#define C2TSEL2                       537
#define C3TSEL0                       538
#define C3TSEL                        539
#define C3TSEL1                       540
#define CM3CON                        541
#define CM3CON_CCH                    542
#define CCH03                         543
#define CM3CON_CCH0                   544
#define CCH13                         545
#define CM3CON_CCH1                   546
#define CM3CON_CREF                   547
#define CREF3                         548
#define CM3CON_EVPOL                  549
#define EVPOL03                       550
#define CM3CON_EVPOL0                 551
#define CM3CON_EVPOL1                 552
#define EVPOL13                       553
#define CM3CON_CPOL                   554
#define CPOL3                         555
#define COE3                          556
#define CM3CON_COE                    557
#define CM3CON_CON                    558
#define CON3                          559
#define CM2CON                        560
#define CM2CON_CCH                    561
#define CM2CON_CCH0                   562
#define CCH02                         563
#define CCH12                         564
#define CM2CON_CCH1                   565
#define CM2CON_CREF                   566
#define CREF2                         567
#define CM2CON_EVPOL                  568
#define EVPOL02                       569
#define CM2CON_EVPOL0                 570
#define EVPOL12                       571
#define CM2CON_EVPOL1                 572
#define CM2CON_CPOL                   573
#define CPOL2                         574
#define CM2CON_COE                    575
#define COE2                          576
#define CM2CON_CON                    577
#define CON2                          578
#define T8CON                         579
#define T8CKPS0                       580
#define T8CKPS                        581
#define T8CKPS1                       582
#define TMR8ON                        583
#define T8OUTPS                       584
#define T8OUTPS0                      585
#define T8OUTPS1                      586
#define T8OUTPS2                      587
#define T8OUTPS3                      588
#define PR8                           589
#define TMR8                          590
#define T6CON                         591
#define T6CKPS0                       592
#define T6CKPS                        593
#define T6CKPS1                       594
#define TMR6ON                        595
#define T6OUTPS0                      596
#define T6OUTPS                       597
#define T6OUTPS1                      598
#define T6OUTPS2                      599
#define T6OUTPS3                      600
#define PR6                           601
#define TMR6                          602
#define CCP8CON                       603
#define CCP8M0                        604
#define CCP8M                         605
#define CCP8M1                        606
#define CCP8M2                        607
#define CCP8M3                        608
#define DC8B0                         609
#define CCP8Y                         610
#define DC8B                          611
#define DC8B1                         612
#define CCP8X                         613
#define CCPR8L                        614
#define CCPR8H                        615
#define CCP3CON                       616
#define CCP3M                         617
#define CCP3M0                        618
#define CCP3M1                        619
#define CCP3M2                        620
#define CCP3M3                        621
#define CCP3Y                         622
#define DC3B                          623
#define DC3B0                         624
#define DC3B1                         625
#define CCP3X                         626
#define P3M                           627
#define P3M0                          628
#define P3M1                          629
#define CCPR3L                        630
#define CCPR3H                        631
#define ECCP3DEL                      632
#define P3DC                          633
#define P3DC0                         634
#define P3DC1                         635
#define P3DC2                         636
#define P3DC3                         637
#define P3DC4                         638
#define P3DC5                         639
#define P3DC6                         640
#define P3RSEN                        641
#define PSS3BD0                       642
#define PSS3BD                        643
#define PSS3BD1                       644
#define PSS3AC0                       645
#define PSS3AC                        646
#define PSS3AC1                       647
#define ECCP3AS                       648
#define ECCP3AS0                      649
#define ECCP3AS1                      650
#define ECCP3AS2                      651
#define ECCP3ASE                      652
#define CCP2CON                       653
#define CCP2M                         654
#define CCP2M0                        655
#define CCP2M1                        656
#define CCP2M2                        657
#define CCP2M3                        658
#define DC2B                          659
#define DC2B0                         660
#define CCP2Y                         661
#define DC2B1                         662
#define CCP2X                         663
#define P2M                           664
#define P2M0                          665
#define P2M1                          666
#define CCPR2L                        667
#define CCPR2H                        668
#define ECCP2DEL                      669
#define P2DC                          670
#define P2DC0                         671
#define P2DC1                         672
#define P2DC2                         673
#define P2DC3                         674
#define P2DC4                         675
#define P2DC5                         676
#define P2DC6                         677
#define P2RSEN                        678
#define PSS2BD                        679
#define PSS2BD0                       680
#define PSS2BD1                       681
#define PSS2AC0                       682
#define PSS2AC                        683
#define PSS2AC1                       684
#define ECCP2AS0                      685
#define ECCP2AS                       686
#define ECCP2AS1                      687
#define ECCP2AS2                      688
#define ECCP2ASE                      689
#define PADCFG1                       690
#define RTSECSEL0                     691
#define RTSECSEL                      692
#define RTSECSEL1                     693
#define PADCFG1_RJPU                  694
#define REPU                          695
#define RDPU                          696
#define CM1CON                        697
#define CM1CON_CCH                    698
#define C1CH0                         699
#define CM1CON_CCH0                   700
#define CCH01                         701
#define CCH11                         702
#define C1CH1                         703
#define CM1CON_CCH1                   704
#define CM1CON_CREF                   705
#define CREF1                         706
#define EVPOL01                       707
#define CM1CON_EVPOL0                 708
#define CM1CON_EVPOL                  709
#define CM1CON_EVPOL1                 710
#define EVPOL11                       711
#define CM1CON_CPOL                   712
#define CPOL1                         713
#define CM1CON_COE                    714
#define COE1                          715
#define CM1CON_CON                    716
#define CON1                          717
#define CTMUICON                      718
#define IRNG                          719
#define IRNG0                         720
#define IRNG1                         721
#define ITRIM0                        722
#define ITRIM                         723
#define ITRIM1                        724
#define ITRIM2                        725
#define ITRIM3                        726
#define ITRIM4                        727
#define ITRIM5                        728
#define CTMUCONL                      729
#define EDG1STAT                      730
#define EDG2STAT                      731
#define EDG1SEL                       732
#define EDG1SEL0                      733
#define EDG1SEL1                      734
#define EDG1POL                       735
#define EDG2SEL0                      736
#define EDG2SEL                       737
#define EDG2SEL1                      738
#define EDG2POL                       739
#define CTMUCONH                      740
#define CTTRIG                        741
#define IDISSEN                       742
#define EDGSEQEN                      743
#define EDGEN                         744
#define TGEN                          745
#define CTMUSIDL                      746
#define CTMUEN                        747
#define ALRMVALL                      748
#define ALRMVALH                      749
#define ALRMRPT                       750
#define ARPT0                         751
#define ARPT                          752
#define ARPT1                         753
#define ARPT2                         754
#define ARPT3                         755
#define ARPT4                         756
#define ARPT5                         757
#define ARPT6                         758
#define ARPT7                         759
#define ALRMCFG                       760
#define ALRMPTR                       761
#define ALRMPTR0                      762
#define ALRMPTR1                      763
#define AMASK0                        764
#define AMASK                         765
#define AMASK1                        766
#define AMASK2                        767
#define AMASK3                        768
#define CHIME                         769
#define ALRMEN                        770
#define RTCVALL                       771
#define WAITE0                        772
#define RTCVALH                       773
#define WAITE1                        774
#define WAITM0                        775
#define WAITM1                        776
#define WAITM2                        777
#define WAITM3                        778
#define WAITB0                        779
#define WAITB1                        780
#define RTCCAL                        781
#define CAL0                          782
#define CAL                           783
#define CAL1                          784
#define CAL2                          785
#define CAL3                          786
#define CAL4                          787
#define CAL5                          788
#define CAL6                          789
#define CAL7                          790
#define RTCCFG                        791
#define RTCPTR0                       792
#define RTCPTR                        793
#define RTCPTR1                       794
#define RTCOE                         795
#define HALFSEC                       796
#define RTCSYNC                       797
#define RTCWREN                       798
#define RTCEN                         799
#define PIE6                          800
#define CMP1IE                        801
#define CMP2IE                        802
#define CMP3IE                        803
#define EEIE                          804
#define EEDATA                        805
#define EEADR                         806
#define EEADRH                        807
#define OSCCON2                       808
#define MFIOSEL                       809
#define MFIOFS                        810
#define SOSCGO                        811
#define SOSCRUN                       812
#define BAUDCON1                      813
#define BAUDCON1_ABDEN                814
#define ABDEN1                        815
#define BAUDCON1_WUE                  816
#define WUE1                          817
#define W4E                           818
#define BRG161                        819
#define BAUDCON1_BRG16                820
#define CKTXP                         821
#define BAUDCON1_TXCKP                822
#define SCKP1                         823
#define TXCKP1                        824
#define SCKP                          825
#define DTRXP1                        826
#define RXDTP1                        827
#define DTRXP                         828
#define RXCKP                         829
#define BAUDCON1_RXDTP                830
#define RCMT1                         831
#define RCIDL1                        832
#define BAUDCON1_RCIDL                833
#define RCMT                          834
#define ABDOVF1                       835
#define BAUDCON1_ABDOVF               836
#define LCDDATA0                      837
#define S00C0                         838
#define S01C0                         839
#define S02C0                         840
#define S03C0                         841
#define S04C0                         842
#define S05C0                         843
#define S06C0                         844
#define S07C0                         845
#define LCDDATA1                      846
#define S08C0                         847
#define S09C0                         848
#define S10C0                         849
#define S11C0                         850
#define S12C0                         851
#define S13C0                         852
#define S14C0                         853
#define S15C0                         854
#define LCDDATA2                      855
#define S16C0                         856
#define S17C0                         857
#define S18C0                         858
#define S19C0                         859
#define S20C0                         860
#define S21C0                         861
#define S22C0                         862
#define S23C0                         863
#define LCDDATA3                      864
#define S24C0                         865
#define S25C0                         866
#define S26C0                         867
#define S27C0                         868
#define S28C0                         869
#define S29C0                         870
#define S30C0                         871
#define S31C0                         872
#define LCDDATA4                      873
#define S32C0                         874
#define S33C0                         875
#define S34C0                         876
#define S35C0                         877
#define S36C0                         878
#define S37C0                         879
#define S38C0                         880
#define S39C0                         881
#define LCDDATA5                      882
#define S40C0                         883
#define S40C15                        884
#define S41C0                         885
#define S42C0                         886
#define S43C0                         887
#define S44C0                         888
#define S45C0                         889
#define S46C0                         890
#define S47C0                         891
#define LCDDATA6                      892
#define S00C1                         893
#define S01C1                         894
#define S02C1                         895
#define S03C1                         896
#define S04C1                         897
#define S05C1                         898
#define S06C1                         899
#define S07C1                         900
#define LCDDATA7                      901
#define S08C1                         902
#define S09C1                         903
#define S10C1                         904
#define S11C1                         905
#define S12C1                         906
#define S13C1                         907
#define S14C1                         908
#define S15C1                         909
#define LCDDATA8                      910
#define S16C1                         911
#define S17C1                         912
#define S18C1                         913
#define S19C1                         914
#define S20C1                         915
#define S21C1                         916
#define S22C1                         917
#define S23C1                         918
#define LCDDATA9                      919
#define S24C1                         920
#define S25C1                         921
#define S26C1                         922
#define S27C1                         923
#define S28C1                         924
#define S29C1                         925
#define S30C1                         926
#define S31C1                         927
#define LCDDATA10                     928
#define S32C1                         929
#define S33C1                         930
#define S34C1                         931
#define S35C1                         932
#define S36C1                         933
#define S37C1                         934
#define S38C1                         935
#define S39C1                         936
#define LCDDATA11                     937
#define S40C1                         938
#define LCDDATA11_ADMSK1              939
#define S41C1                         940
#define S42C1                         941
#define LCDDATA11_ADMSK2              942
#define LCDDATA11_ADMSK3              943
#define S43C1                         944
#define LCDDATA11_ADMSK4              945
#define S44C1                         946
#define LCDDATA11_ADMSK5              947
#define S45C1                         948
#define S46C1                         949
#define S47C1                         950
#define LCDDATA12                     951
#define SSPM012                       952
#define S00C2                         953
#define S01C2                         954
#define SSPM112                       955
#define SSPM212                       956
#define S02C2                         957
#define S03C2                         958
#define SSPM312                       959
#define S04C2                         960
#define S05C2                         961
#define S06C2                         962
#define S07C2                         963
#define LCDDATA13                     964
#define S08C2                         965
#define S09C2                         966
#define S10C2                         967
#define S11C2                         968
#define S12C2                         969
#define S13C2                         970
#define S14C2                         971
#define S15C2                         972
#define LCDDATA14                     973
#define LCDDATA14_MSK0                974
#define S16C2                         975
#define LCDDATA14_MSK1                976
#define S17C2                         977
#define LCDDATA14_MSK2                978
#define S18C2                         979
#define S19C2                         980
#define LCDDATA14_MSK3                981
#define LCDDATA14_MSK4                982
#define S20C2                         983
#define LCDDATA14_MSK5                984
#define S21C2                         985
#define LCDDATA14_MSK6                986
#define S22C2                         987
#define LCDDATA14_MSK7                988
#define S23C2                         989
#define LCDDATA15                     990
#define S24C2                         991
#define S25C2                         992
#define S26C2                         993
#define S27C2                         994
#define S28C2                         995
#define S29C2                         996
#define S30C2                         997
#define S31C2                         998
#define LCDDATA16                     999
#define S32C2                         1000
#define T4CKPS016                     1001
#define T4CKPS116                     1002
#define S33C2                         1003
#define S34C2                         1004
#define T4OUTPS016                    1005
#define S35C2                         1006
#define S36C2                         1007
#define T4OUTPS116                    1008
#define T4OUTPS216                    1009
#define S37C2                         1010
#define S38C2                         1011
#define T4OUTPS316                    1012
#define S39C2                         1013
#define LCDDATA17                     1014
#define S40C2                         1015
#define S41C2                         1016
#define S42C2                         1017
#define S43C2                         1018
#define S44C2                         1019
#define S45C2                         1020
#define S46C2                         1021
#define S47C2                         1022
#define LCDDATA18                     1023
#define S00C3                         1024
#define S01C3                         1025
#define S02C3                         1026
#define S03C3                         1027
#define S04C3                         1028
#define S05C3                         1029
#define S06C3                         1030
#define S07C3                         1031
#define LCDDATA19                     1032
#define S08C3                         1033
#define S09C3                         1034
#define S10C3                         1035
#define S11C3                         1036
#define S12C3                         1037
#define T3CKPS019                     1038
#define T3CKPS119                     1039
#define S13C3                         1040
#define S14C3                         1041
#define TMR3CS019                     1042
#define TMR3CS119                     1043
#define S15C3                         1044
#define LCDDATA20                     1045
#define S16C3                         1046
#define S17C3                         1047
#define S18C3                         1048
#define S19C3                         1049
#define S20C3                         1050
#define S21C3                         1051
#define S22C3                         1052
#define S23C3                         1053
#define LCDDATA21                     1054
#define S24C3                         1055
#define S25C3                         1056
#define S26C3                         1057
#define S27C3                         1058
#define S28C3                         1059
#define S29C3                         1060
#define S30C3                         1061
#define S31C3                         1062
#define LCDDATA22                     1063
#define S32C3                         1064
#define S33C3                         1065
#define S34C3                         1066
#define S35C3                         1067
#define S36C3                         1068
#define S37C3                         1069
#define S38C3                         1070
#define S39C3                         1071
#define LCDDATA23                     1072
#define S40C3                         1073
#define S41C3                         1074
#define S42C3                         1075
#define S43C3                         1076
#define S44C3                         1077
#define S45C3                         1078
#define S46C3                         1079
#define S47C3                         1080
#define EECON2                        1081
#define EECON1                        1082
#define EECON1_RD                     1083
#define EECON1_WR                     1084
#define WREN                          1085
#define WRERR                         1086
#define FREE                          1087
#define CFGS                          1088
#define EEFS                          1089
#define EEPGD                         1090
