tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k90_tdd.h
#define PORTA                         1091
#define ULPWUIN                       1092
#define AN0                           1093
#define RA0                           1094
#define SEG18                         1095
#define AN1                           1096
#define RA1                           1097
#define AN2                           1098
#define RA2                           1099
#define VREF_MINUS                    1100
#define AN3                           1101
#define VREF_PLUS                     1102
#define RA3                           1103
#define SEG14                         1104
#define T0CKI                         1105
#define RA4                           1106
#define SEG15                         1107
#define AN4                           1108
#define T1CKI                         1109
#define LVDIN                         1110
#define RA5                           1111
#define T3G                           1112
#define CLKO                          1113
#define RA6                           1114
#define OSC2                          1115
#define CLKI                          1116
#define PORTA_RJPU                    1117
#define RA7                           1118
#define OSC1                          1119
#define PORTB                         1120
#define SEG30                         1121
#define FLT0                          1122
#define RB0                           1123
#define INT0                          1124
#define RB1                           1125
#define INT1                          1126
#define SEG8                          1127
#define RB2                           1128
#define INT2                          1129
#define CTED1                         1130
#define SEG9                          1131
#define SEG10                         1132
#define RB3                           1133
#define INT3                          1134
#define CCP2_PA2                      1135
#define CTED2                         1136
#define SEG11                         1137
#define RB4                           1138
#define KBI0                          1139
#define PGM                           1140
#define T3CKI                         1141
#define RB5                           1142
#define SEG29                         1143
#define KBI1                          1144
#define T1G                           1145
#define PGC                           1146
#define RB6                           1147
#define KBI2                          1148
#define PGD                           1149
#define RB7                           1150
#define KBI3                          1151
#define PORTC                         1152
#define SCKLI                         1153
#define RC0                           1154
#define SOSCO                         1155
#define SEG32                         1156
#define PORTC_PA2                     1157
#define PORTC_CCP2                    1158
#define RC1                           1159
#define SOSCI                         1160
#define SEG13                         1161
#define CCP1                          1162
#define PA1                           1163
#define RC2                           1164
#define SEG17                         1165
#define SCK1                          1166
#define SCL1                          1167
#define RC3                           1168
#define SEG16                         1169
#define SDI1                          1170
#define SDA1                          1171
#define RC4                           1172
#define SEG12                         1173
#define SDO1                          1174
#define RC5                           1175
#define SEG27                         1176
#define TX1                           1177
#define RC6                           1178
#define CK1                           1179
#define DT1                           1180
#define RX1                           1181
#define SEG28                         1182
#define RC7                           1183
#define PORTD                         1184
#define PSP0                          1185
#define RD0                           1186
#define CTPLS                         1187
#define AD0                           1188
#define SEG0                          1189
#define PSP1                          1190
#define RD1                           1191
#define T5CKI                         1192
#define T7G                           1193
#define AD1                           1194
#define SEG1                          1195
#define PSP2                          1196
#define RD2                           1197
#define AD2                           1198
#define SEG2                          1199
#define PSP3                          1200
#define RD3                           1201
#define AD3                           1202
#define SEG3                          1203
#define PSP4                          1204
#define RD4                           1205
#define AD4                           1206
#define SDO2                          1207
#define SEG4                          1208
#define PSP5                          1209
#define RD5                           1210
#define SDI2                          1211
#define AD5                           1212
#define SDA2                          1213
#define SEG5                          1214
#define SEG6                          1215
#define SCK2                          1216
#define PSP6                          1217
#define RD6                           1218
#define AD6                           1219
#define SCL2                          1220
#define SS2                           1221
#define PSP7                          1222
#define RD7                           1223
#define AD7                           1224
#define SEG7                          1225
#define PORTE                         1226
#define PD2                           1227
#define AD8                           1228
#define PORTE_RD                      1229
#define RDE                           1230
#define LCDBIAS1                      1231
#define RE0                           1232
#define AD9                           1233
#define PORTE_WR                      1234
#define WRE                           1235
#define LCDBIAS2                      1236
#define RE1                           1237
#define PC2                           1238
#define PORTE_CS                      1239
#define PB2                           1240
#define CCP10                         1241
#define AD10                          1242
#define LCDBIAS3                      1243
#define RE2                           1244
#define PORTE_CCP9                    1245
#define COM0                          1246
#define PORTE_PC3                     1247
#define CCP9E                         1248
#define AD11                          1249
#define RE3                           1250
#define PC3E                          1251
#define PORTE_CCP8                    1252
#define PB3E                          1253
#define COM1                          1254
#define PORTE_PB3                     1255
#define REFO                          1256
#define AD12                          1257
#define RE4                           1258
#define CCP8E                         1259
#define PORTE_CCP7                    1260
#define COM2                          1261
#define PORTE_PC1                     1262
#define CCP7E                         1263
#define AD13                          1264
#define RE5                           1265
#define PC1E                          1266
#define PORTE_CCP6                    1267
#define CCP6E                         1268
#define COM3                          1269
#define AD14                          1270
#define RE6                           1271
#define PB1E                          1272
#define PORTE_PB1                     1273
#define PORTE_CCP2                    1274
#define CCP2E                         1275
#define SEG31                         1276
#define PA2E                          1277
#define PORTE_PA2                     1278
#define AD15                          1279
#define RE7                           1280
#define PORTF                         1281
#define SEG19                         1282
#define C2OUTF                        1283
#define AN6                           1284
#define PORTF_C2OUT                   1285
#define RF1                           1286
#define CTDIN                         1287
#define PORTF_C1OUT                   1288
#define AN7                           1289
#define RF2                           1290
#define C1OUTF                        1291
#define SEG20                         1292
#define AN8                           1293
#define RF3                           1294
#define SEG21                         1295
#define CTMUI                         1296
#define C2INB                         1297
#define AN9                           1298
#define RF4                           1299
#define SEG22                         1300
#define C2INA                         1301
#define C1INB                         1302
#define RF5                           1303
#define SEG23                         1304
#define CVREF                         1305
#define AN10                          1306
#define C1INA                         1307
#define RF6                           1308
#define SEG24                         1309
#define AN11                          1310
#define SS1                           1311
#define AN5                           1312
#define RF7                           1313
#define SEG25                         1314
#define PORTG                         1315
#define CCP3                          1316
#define PA3                           1317
#define RG0                           1318
#define C3OUTG                        1319
#define PORTG_C3OUT                   1320
#define TX2                           1321
#define RG1                           1322
#define CK2                           1323
#define AN19                          1324
#define C3INA                         1325
#define RX2                           1326
#define RG2                           1327
#define DT2                           1328
#define AN18                          1329
#define CCP4                          1330
#define PD3                           1331
#define C3INB                         1332
#define RG3                           1333
#define AN17                          1334
#define CCP5                          1335
#define PD1                           1336
#define SEG26                         1337
#define C3INC                         1338
#define T7CKI                         1339
#define T5G                           1340
#define RG4                           1341
#define RTCC                          1342
#define AN16                          1343
#define PORTG_RJPU                    1344
#define RG5                           1345
#define PORTH                         1346
#define RH0                           1347
#define A16                           1348
#define SEG47                         1349
#define AN23                          1350
#define RH1                           1351
#define A17                           1352
#define SEG46                         1353
#define AN22                          1354
#define RH2                           1355
#define A18                           1356
#define SEG45                         1357
#define AN21                          1358
#define RH3                           1359
#define A19                           1360
#define SEG44                         1361
#define AN20                          1362
#define PORTH_CCP9                    1363
#define RH4                           1364
#define SEG40                         1365
#define C2INC                         1366
#define PORTH_PC3                     1367
#define AN12                          1368
#define PORTH_CCP8                    1369
#define RH5                           1370
#define SEG41                         1371
#define PORTH_PB3                     1372
#define AN13                          1373
#define C2IND                         1374
#define C1INC                         1375
#define RH6                           1376
#define SEG42                         1377
#define PORTH_CCP7                    1378
#define PORTH_PC1                     1379
#define AN14                          1380
#define RH7                           1381
#define PORTH_CCP6                    1382
#define SEG43                         1383
#define PORTH_PB1                     1384
#define AN15                          1385
#define PORTJ                         1386
#define RJ0                           1387
#define ALE                           1388
#define RJ1                           1389
#define SEG33                         1390
#define OE                            1391
#define RJ2                           1392
#define SEG34                         1393
#define WRL                           1394
#define RJ3                           1395
#define SEG35                         1396
#define WRH                           1397
#define RJ4                           1398
#define SEG39                         1399
#define BA0                           1400
#define RJ5                           1401
#define SEG38                         1402
#define CE                            1403
#define RJ6                           1404
#define SEG37                         1405
#define LB                            1406
#define RJ7                           1407
#define SEG36                         1408
#define UB                            1409
#define LATA                          1410
#define LATA0                         1411
#define LA0                           1412
#define LATA1                         1413
#define LA1                           1414
#define LATA2                         1415
#define LA2                           1416
#define LATA3                         1417
#define LA3                           1418
#define LATA4                         1419
#define LA4                           1420
#define LATA5                         1421
#define LA5                           1422
#define LATA6                         1423
#define LA6                           1424
#define LATA7                         1425
#define LA7                           1426
#define LATB                          1427
#define LB0                           1428
#define LATB0                         1429
#define LB1                           1430
#define LATB1                         1431
#define LB2                           1432
#define LATB2                         1433
#define LB3                           1434
#define LATB3                         1435
#define LB4                           1436
#define LATB4                         1437
#define LB5                           1438
#define LATB5                         1439
#define LB6                           1440
#define LATB6                         1441
#define LB7                           1442
#define LATB7                         1443
#define LATC                          1444
#define LATC0                         1445
#define LC0                           1446
#define LATC1                         1447
#define LC1                           1448
#define LATC2                         1449
#define LC2                           1450
#define LATC3                         1451
#define LC3                           1452
#define LATC4                         1453
#define LC4                           1454
#define LATC5                         1455
#define LC5                           1456
#define LATC6                         1457
#define LC6                           1458
#define LATC7                         1459
#define LC7                           1460
#define LATD                          1461
#define LATD0                         1462
#define LD0                           1463
#define LATD1                         1464
#define LD1                           1465
#define LATD2                         1466
#define LD2                           1467
#define LATD3                         1468
#define LD3                           1469
#define LATD4                         1470
#define LD4                           1471
#define LATD5                         1472
#define LD5                           1473
#define LATD6                         1474
#define LD6                           1475
#define LATD7                         1476
#define LD7                           1477
#define LATE                          1478
#define LATE0                         1479
#define LE0                           1480
#define LATE1                         1481
#define LE1                           1482
#define LATE2                         1483
#define LE2                           1484
#define LATE3                         1485
#define LE3                           1486
#define LATE4                         1487
#define LE4                           1488
#define LATE5                         1489
#define LE5                           1490
#define LATE6                         1491
#define LE6                           1492
#define LATE7                         1493
#define LE7                           1494
#define LATF                          1495
#define LATF1                         1496
#define LF1                           1497
#define LF2                           1498
#define LATF2                         1499
#define LF3                           1500
#define LATF3                         1501
#define LF4                           1502
#define LATF4                         1503
#define LF5                           1504
#define LATF5                         1505
#define LF6                           1506
#define LATF6                         1507
#define LF7                           1508
#define LATF7                         1509
#define LATG                          1510
#define LATG0                         1511
#define LG0                           1512
#define LATG1                         1513
#define LG1                           1514
#define LATG2                         1515
#define LG2                           1516
#define LATG3                         1517
#define LG3                           1518
#define LATG4                         1519
#define LG4                           1520
#define LATH                          1521
#define LH0                           1522
#define LATH0                         1523
#define LH1                           1524
#define LATH1                         1525
#define LH2                           1526
#define LATH2                         1527
#define LH3                           1528
#define LATH3                         1529
#define LH4                           1530
#define LATH4                         1531
#define LH5                           1532
#define LATH5                         1533
#define LH6                           1534
#define LATH6                         1535
#define LH7                           1536
#define LATH7                         1537
#define LATJ                          1538
#define LATJ0                         1539
#define LJ0                           1540
#define LATJ1                         1541
#define LJ1                           1542
#define LATJ2                         1543
#define LJ2                           1544
#define LATJ3                         1545
#define LJ3                           1546
#define LATJ4                         1547
#define LJ4                           1548
#define LATJ5                         1549
#define LJ5                           1550
#define LATJ6                         1551
#define LJ6                           1552
#define LATJ7                         1553
#define LJ7                           1554
#define TRISA                         1555
#define TRISA0                        1556
#define TRISA1                        1557
#define TRISA2                        1558
#define TRISA3                        1559
#define TRISA4                        1560
#define TRISA5                        1561
#define TRISA6                        1562
#define TRISA7                        1563
#define TRISB                         1564
#define TRISB0                        1565
#define TRISB1                        1566
#define TRISB2                        1567
#define TRISB3                        1568
#define TRISB4                        1569
#define TRISB5                        1570
#define TRISB6                        1571
#define TRISB7                        1572
#define TRISC                         1573
#define TRISC0                        1574
#define TRISC1                        1575
#define TRISC2                        1576
#define TRISC3                        1577
#define TRISC4                        1578
#define TRISC5                        1579
#define TRISC6                        1580
#define TRISC7                        1581
#define TRISD                         1582
#define TRISD0                        1583
#define TRISD1                        1584
#define TRISD2                        1585
#define TRISD3                        1586
#define TRISD4                        1587
#define TRISD5                        1588
#define TRISD6                        1589
#define TRISD7                        1590
#define TRISE                         1591
#define TRISE0                        1592
#define TRISE1                        1593
#define TRISE2                        1594
#define TRISE3                        1595
#define TRISE4                        1596
#define TRISE5                        1597
#define TRISE6                        1598
#define TRISE7                        1599
#define TRISF                         1600
#define TRISF1                        1601
#define TRISF2                        1602
#define TRISF3                        1603
#define TRISF4                        1604
#define TRISF5                        1605
#define TRISF6                        1606
#define TRISF7                        1607
#define TRISG                         1608
#define TRISG0                        1609
#define TRISG1                        1610
#define TRISG2                        1611
#define TRISG3                        1612
#define TRISG4                        1613
#define TRISH                         1614
#define TRISH0                        1615
#define TRISH1                        1616
#define TRISH2                        1617
#define TRISH3                        1618
#define TRISH4                        1619
#define TRISH5                        1620
#define TRISH6                        1621
#define TRISH7                        1622
#define TRISJ                         1623
#define TRISJ0                        1624
#define TRISJ1                        1625
#define TRISJ2                        1626
#define TRISJ3                        1627
#define TRISJ4                        1628
#define TRISJ5                        1629
#define TRISJ6                        1630
#define TRISJ7                        1631
#define OSCTUNE                       1632
#define TUN0                          1633
#define TUN                           1634
#define TUN1                          1635
#define TUN2                          1636
#define TUN3                          1637
#define TUN4                          1638
#define TUN5                          1639
#define PLLEN                         1640
#define INTSRC                        1641
#define PSTR1CON                      1642
#define PSTR1CON_STRA                 1643
#define PSTR1CON_STRB                 1644
#define PSTR1CON_STRC                 1645
#define PSTR1CON_STRD                 1646
#define PSTR1CON_STRSYNC              1647
#define PSTR1CON_CMPL0                1648
