tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k90_tdd.h
#define PSTR1CON_CMPL                 1649
#define PSTR1CON_CMPL1                1650
#define PIE1                          1651
#define TMR1IE                        1652
#define TMR2IE                        1653
#define TMR1GIE                       1654
#define SSP1IE                        1655
#define SSPIE                         1656
#define TXIE                          1657
#define TX1IE                         1658
#define RCIE                          1659
#define RC1IE                         1660
#define ADIE                          1661
#define PIR1                          1662
#define TMR1IF                        1663
#define TMR2IF                        1664
#define TMR1GIF                       1665
#define SSPIF                         1666
#define SSP1IF                        1667
#define TXIF                          1668
#define TX1IF                         1669
#define RCIF                          1670
#define RC1IF                         1671
#define ADIF                          1672
#define IPR1                          1673
#define TMR1IP                        1674
#define TMR2IP                        1675
#define TMR1GIP                       1676
#define SSPIP                         1677
#define SSP1IP                        1678
#define TX1IP                         1679
#define TXIP                          1680
#define RCIP                          1681
#define RC1IP                         1682
#define ADIP                          1683
#define PIE2                          1684
#define TMR3GIE                       1685
#define TMR3IE                        1686
#define HLVDIE                        1687
#define LVDIE                         1688
#define BCL1IE                        1689
#define BCLIE                         1690
#define BCL2IE                        1691
#define SSP2IE                        1692
#define OSCFIE                        1693
#define PIR2                          1694
#define TMR3GIF                       1695
#define TMR3IF                        1696
#define HLVDIF                        1697
#define LVDIF                         1698
#define BCLIF                         1699
#define BCL1IF                        1700
#define BCL2IF                        1701
#define SSP2IF                        1702
#define OSCFIF                        1703
#define IPR2                          1704
#define TMR3GIP                       1705
#define TMR3IP                        1706
#define HLVDIP                        1707
#define LVDIP                         1708
#define BCLIP                         1709
#define BCL1IP                        1710
#define BCL2IP                        1711
#define SSP2IP                        1712
#define OSCFIP                        1713
#define PIE3                          1714
#define RXB0IE                        1715
#define RTCCIE                        1716
#define RXBNIE                        1717
#define CCP1IE                        1718
#define RXB1IE                        1719
#define CCP2IE                        1720
#define TXB0IE                        1721
#define CTMUIE                        1722
#define TXB1IE                        1723
#define TXBNIE                        1724
#define TXB2IE                        1725
#define TX2IE                         1726
#define RC2IE                         1727
#define LCDIE                         1728
#define TMR5GIE                       1729
#define PIR3                          1730
#define RTCCIF                        1731
#define RXBNIF                        1732
#define CCP1IF                        1733
#define CCP2IF                        1734
#define CTMUIF                        1735
#define TXBNIF                        1736
#define TX2IF                         1737
#define RC2IF                         1738
#define LCDIF                         1739
#define TMR5GIF                       1740
#define IPR3                          1741
#define RTCCIP                        1742
#define CCP1IP                        1743
#define RXBNIP                        1744
#define CCP2IP                        1745
#define CTMUIP                        1746
#define TX2IP                         1747
#define TXBNIP                        1748
#define RC2IP                         1749
#define LCDIP                         1750
#define TMR5GIP                       1751
#define PIR6                          1752
#define CMP1IF                        1753
#define CMP2IF                        1754
#define CMP3IF                        1755
#define EEIF                          1756
#define HLVDCON                       1757
#define HLVDL                         1758
#define HLVDL0                        1759
#define HLVDL1                        1760
#define HLVDL2                        1761
#define HLVDL3                        1762
#define HLVDEN                        1763
#define IRVST                         1764
#define BGVST                         1765
#define VDIRMAG                       1766
#define IPR6                          1767
#define CMP1IP                        1768
#define CMP2IP                        1769
#define CMP3IP                        1770
#define EEIP                          1771
#define T1GCON                        1772
#define T1GSS0                        1773
#define T1GSS                         1774
#define T1GSS1                        1775
#define T1GVAL                        1776
#define T1GGO_nT1DONE                 1777
#define nT1DONE                       1778
#define T1GGO_NOT_T1DONE              1779
#define NOT_T1DONE                    1780
#define T1GGO                         1781
#define T1GSPM                        1782
#define T1GTM                         1783
#define T1GPOL                        1784
#define TMR1GE                        1785
#define RCSTA1                        1786
#define RCSTA1_RX9D                   1787
#define RX9D1                         1788
#define RCD8                          1789
#define RCSTA1_OERR                   1790
#define OERR1                         1791
#define RCSTA1_FERR                   1792
#define FERR1                         1793
#define RCSTA1_ADDEN                  1794
#define ADDEN1                        1795
#define ADEN                          1796
#define RCSTA1_CREN                   1797
#define CREN1                         1798
#define SRENA                         1799
#define SREN1                         1800
#define RCSTA1_SREN                   1801
#define RC8_9                         1802
#define RCSTA1_RX9                    1803
#define nRC8                          1804
#define NOT_RC8                       1805
#define RC9                           1806
#define RX91                          1807
#define RCSTA1_SPEN                   1808
#define SPEN1                         1809
#define TXSTA1                        1810
#define TX9D1                         1811
#define TXSTA1_TX9D                   1812
#define TXD8                          1813
#define TRMT1                         1814
#define TXSTA1_TRMT                   1815
#define BRGH1                         1816
#define TXSTA1_BRGH                   1817
#define TXSTA1_SENDB                  1818
#define SENDB1                        1819
#define TXSTA1_SYNC                   1820
#define SYNC1                         1821
#define TXEN1                         1822
#define TXSTA1_TXEN                   1823
#define TX91                          1824
#define TX8_9                         1825
#define NOT_TX8                       1826
#define nTX8                          1827
#define TXSTA1_TX9                    1828
#define TXSTA1_CSRC                   1829
#define CSRC1                         1830
#define TXREG1                        1831
#define RCREG1                        1832
#define SPBRG1                        1833
#define T3GCON                        1834
#define T3GSS0                        1835
#define T3GSS                         1836
#define T3GSS1                        1837
#define T3GVAL                        1838
#define T3GGO                         1839
#define NOT_T3DONE                    1840
#define nT3DONE                       1841
#define T3GGO_nT3DONE                 1842
#define T3GGO_NOT_T3DONE              1843
#define T3GSPM                        1844
#define T3GTM                         1845
#define T3GPOL                        1846
#define TMR3GE                        1847
#define T3CON                         1848
#define TMR3ON                        1849
#define T3CON_RD16                    1850
#define nT3SYNC                       1851
#define NOT_T3SYNC                    1852
#define SOSCEN3                       1853
#define T3CON_SOSCEN                  1854
#define T3CKPS0                       1855
#define T3CKPS                        1856
#define T3CKPS1                       1857
#define TMR3CS                        1858
#define TMR3CS0                       1859
#define TMR3CS1                       1860
#define T3RD16                        1861
#define RD163                         1862
#define TMR3L                         1863
#define TMR3H                         1864
#define CMSTAT                        1865
#define CMSTAT_C1OUT                  1866
#define CMP1OUT                       1867
#define CMSTAT_C2OUT                  1868
#define CMP2OUT                       1869
#define CMP3OUT                       1870
#define CMSTAT_C3OUT                  1871
#define CVRCON                        1872
#define CVR                           1873
#define CVR0                          1874
#define CVR1                          1875
#define CVR2                          1876
#define CVR3                          1877
#define CVR4                          1878
#define CVRR                          1879
#define CVRSS                         1880
#define CVROEN                        1881
#define CVROE                         1882
#define CVREN                         1883
#define PIE4                          1884
#define CCP3IE                        1885
#define CCP4IE                        1886
#define CCP5IE                        1887
#define CCP6IE                        1888
#define CCP7IE                        1889
#define CCP8IE                        1890
#define PIR4                          1891
#define CCP3IF                        1892
#define CCP4IF                        1893
#define CCP5IF                        1894
#define CCP6IF                        1895
#define CCP7IF                        1896
#define CCP8IF                        1897
#define IPR4                          1898
#define CCP3IP                        1899
#define CCIP3IP                       1900
#define CCP4IP                        1901
#define CCP5IP                        1902
#define CCP6IP                        1903
#define CCP7IP                        1904
#define CCP8IP                        1905
#define PIE5                          1906
#define TMR4IE                        1907
#define TMR5IE                        1908
#define TMR6IE                        1909
#define TMR8IE                        1910
#define PIR5                          1911
#define TMR4IF                        1912
#define TMR5IF                        1913
#define TMR6IF                        1914
#define TMR8IF                        1915
#define CCP1CON                       1916
#define CCP1M0                        1917
#define CCP1M                         1918
#define CCP1M1                        1919
#define CCP1M2                        1920
#define CCP1M3                        1921
#define CCP1Y                         1922
#define DC1B                          1923
#define DC1B0                         1924
#define CCP1X                         1925
#define DC1B1                         1926
#define P1M                           1927
#define P1M0                          1928
#define P1M1                          1929
#define CCPR1L                        1930
#define CCPR1H                        1931
#define ECCP1DEL                      1932
#define P1DC                          1933
#define P1DC0                         1934
#define P1DC1                         1935
#define P1DC2                         1936
#define P1DC3                         1937
#define P1DC4                         1938
#define P1DC5                         1939
#define P1DC6                         1940
#define P1RSEN                        1941
#define PSS1BD0                       1942
#define PSS1BD                        1943
#define PSS1BD1                       1944
#define PSS1AC                        1945
#define PSS1AC0                       1946
#define PSS1AC1                       1947
#define ECCP1AS                       1948
#define ECCP1AS0                      1949
#define ECCP1AS1                      1950
#define ECCP1AS2                      1951
#define ECCP1ASE                      1952
#define ADCON2                        1953
#define ADCS0                         1954
#define ADCS                          1955
#define ADCS1                         1956
#define ADCS2                         1957
#define ACQT0                         1958
#define ACQT                          1959
#define ACQT1                         1960
#define ACQT2                         1961
#define ADFM                          1962
#define ADCON1                        1963
#define CHSN0                         1964
#define CHSN                          1965
#define CHSN1                         1966
#define CHSN2                         1967
#define VNCFG                         1968
#define CHSN3                         1969
#define VCFG                          1970
#define VCFG01                        1971
#define VCFG0                         1972
#define VCFG11                        1973
#define VCFG1                         1974
#define TRIGSEL                       1975
#define TRIGSEL0                      1976
#define TRIGSEL1                      1977
#define ADCON0                        1978
#define ADON                          1979
#define nDONE                         1980
#define GO_nDONE                      1981
#define NOT_DONE                      1982
#define GODONE                        1983
#define GO_DONE                       1984
#define DONE                          1985
#define GO_NOT_DONE                   1986
#define GO                            1987
#define CHS0                          1988
#define CHS                           1989
#define CHS1                          1990
#define CHS2                          1991
#define CHS3                          1992
#define CHS4                          1993
#define ADRESL                        1994
#define ADRESH                        1995
#define SSP1CON2                      1996
#define SEN1                          1997
#define SSP1CON2_SEN                  1998
#define ADMSK11                       1999
#define SSP1CON2_RSEN                 2000
#define RSEN1                         2001
#define SSP1CON2_ADMSK1               2002
#define SSP1CON2_PEN                  2003
#define ADMSK21                       2004
#define PEN1                          2005
#define SSP1CON2_ADMSK2               2006
#define ADMSK31                       2007
#define RCEN1                         2008
#define SSP1CON2_RCEN                 2009
#define SSP1CON2_ADMSK3               2010
#define SSP1CON2_ACKEN                2011
#define ACKEN1                        2012
#define ADMSK41                       2013
#define SSP1CON2_ADMSK4               2014
#define ACKDT1                        2015
#define ADMSK51                       2016
#define SSP1CON2_ACKDT                2017
#define SSP1CON2_ADMSK5               2018
#define SSP1CON2_ACKSTAT              2019
#define ACKSTAT1                      2020
#define GCEN1                         2021
#define SSP1CON2_GCEN                 2022
#define SSP1CON1                      2023
#define SSP1CON1_SSPM0                2024
#define SSPM01                        2025
#define SSP1CON1_SSPM                 2026
#define SSP1CON1_SSPM1                2027
#define SSPM11                        2028
#define SSP1CON1_SSPM2                2029
#define SSPM21                        2030
#define SSPM31                        2031
#define SSP1CON1_SSPM3                2032
#define SSP1CON1_CKP                  2033
#define CKP1                          2034
#define SSPEN1                        2035
#define SSP1CON1_SSPEN                2036
#define SSPOV1                        2037
#define SSP1CON1_SSPOV                2038
#define WCOL1                         2039
#define SSP1CON1_WCOL                 2040
#define SSP1STAT                      2041
#define BF1                           2042
#define SSP1STAT_BF                   2043
#define UA1                           2044
#define SSP1STAT_UA                   2045
#define SSP1STAT_R_NOT_W              2046
#define RW1                           2047
#define NOT_W                         2048
#define SSP1STAT_R                    2049
#define SSP1STAT_nW                   2050
#define RW                            2051
#define SSP1STAT_READ_WRITE           2052
#define SSP1STAT_nWRITE               2053
#define SSP1STAT_I2C_READ             2054
#define SSP1STAT_R_W                  2055
#define SSP1STAT_NOT_WRITE            2056
#define SSP1STAT_R_nW                 2057
#define SSP1STAT_S                    2058
#define START                         2059
#define SSP1STAT_I2C_START            2060
#define START1                        2061
#define STOP                          2062
#define SSP1STAT_P                    2063
#define STOP1                         2064
#define SSP1STAT_I2C_STOP             2065
#define SSP1STAT_D                    2066
#define SSP1STAT_D_NOT_A              2067
#define NOT_A                         2068
#define SSP1STAT_D_A                  2069
#define SSP1STAT_D_nA                 2070
#define SSP1STAT_NOT_ADDRESS          2071
#define SSP1STAT_nA                   2072
#define DA1                           2073
#define DA                            2074
#define SSP1STAT_I2C_DAT              2075
#define SSP1STAT_nADDRESS             2076
#define SSP1STAT_DATA_ADDRESS         2077
#define SSP1STAT_CKE                  2078
#define CKE1                          2079
#define SSP1STAT_SMP                  2080
#define SMP1                          2081
#define SSP1ADD                       2082
#define SSP1ADD_MSK0                  2083
#define MSK01                         2084
#define SSPADD                        2085
#define SSP1ADD_MSK1                  2086
#define MSK11                         2087
#define SSP1ADD_MSK2                  2088
#define MSK21                         2089
#define MSK31                         2090
#define SSP1ADD_MSK3                  2091
#define SSP1ADD_MSK4                  2092
#define MSK41                         2093
#define MSK51                         2094
#define SSP1ADD_MSK5                  2095
#define MSK61                         2096
#define SSP1ADD_MSK6                  2097
#define SSP1ADD_MSK7                  2098
#define MSK71                         2099
#define SSP1BUF                       2100
#define SSPBUF                        2101
#define T2CON                         2102
#define T2CKPS0                       2103
#define T2CKPS                        2104
#define T2CKPS1                       2105
#define TMR2ON                        2106
#define T2OUTPS0                      2107
#define T2OUTPS                       2108
#define T2OUTPS1                      2109
#define T2OUTPS2                      2110
#define T2OUTPS3                      2111
#define WM0                           2112
#define PR2                           2113
#define WM1                           2114
#define WAIT0                         2115
#define WAIT1                         2116
#define EBDIS                         2117
#define TMR2                          2118
#define T1CON                         2119
#define TMR1ON                        2120
#define T1CON_RD16                    2121
#define NOT_T1SYNC                    2122
#define nT1SYNC                       2123
#define T1OSCEN                       2124
#define T1CON_SOSCEN                  2125
#define T1CKPS0                       2126
#define T1CKPS                        2127
#define T1CKPS1                       2128
#define TMR1CS0                       2129
#define TMR1CS                        2130
#define T1RD16                        2131
#define TMR1CS1                       2132
#define TMR1L                         2133
#define TMR1H                         2134
#define RCON                          2135
#define BOR                           2136
#define NOT_BOR                       2137
#define nBOR                          2138
#define POR                           2139
#define nPOR                          2140
#define NOT_POR                       2141
#define PD                            2142
#define nPD                           2143
#define NOT_PD                        2144
#define nTO                           2145
#define TO                            2146
#define NOT_TO                        2147
#define nRI                           2148
#define NOT_RI                        2149
#define RI                            2150
#define NOT_CM                        2151
#define CM                            2152
#define nCM                           2153
#define SBOREN                        2154
#define IPEN                          2155
#define WDTCON                        2156
#define SWDTEN                        2157
#define SWDTE                         2158
#define ULPSINK                       2159
#define ULPEN                         2160
#define SRETEN                        2161
#define ULPLVL                        2162
#define REGSLP                        2163
#define IPR5                          2164
#define CCH05                         2165
#define TMR4IP                        2166
#define CCH15                         2167
#define TMR5IP                        2168
#define TMR6IP                        2169
#define EVPOL15                       2170
#define TMR8IP                        2171
#define OSCCON                        2172
#define SCS0                          2173
#define SCS                           2174
#define SCS1                          2175
#define HFIOFS                        2176
#define OSTS                          2177
#define IRCF                          2178
#define IRCF0                         2179
#define IRCF1                         2180
#define IRCF2                         2181
#define IDLEN                         2182
#define SPBRGH1                       2183
#define T0CON                         2184
#define T0PS                          2185
#define T0PS0                         2186
#define T0PS1                         2187
#define T0PS2                         2188
#define PSA                           2189
#define T0SE                          2190
#define T0CS                          2191
#define T08BIT                        2192
#define TMR0ON                        2193
#define TMR0L                         2194
#define TMR0H                         2195
#define STATUS                        2196
#define C                             2197
#define CARRY                         2198
#define DC                            2199
#define ZERO                          2200
#define Z                             2201
#define OV                            2202
#define OVERFLOW                      2203
#define N                             2204
#define NEGATIVE                      2205
#define FSR2L                         2206
