tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k90_tdd.h
#define PLUSW2                        2207
#define PREINC2                       2208
#define POSTDEC2                      2209
#define POSTINC2                      2210
#define INDF2                         2211
#define FSR1L                         2212
#define PLUSW1                        2213
#define PREINC1                       2214
#define POSTDEC1                      2215
#define POSTINC1                      2216
#define INDF1                         2217
#define WREG                          2218
#define FSR0L                         2219
#define PLUSW0                        2220
#define PREINC0                       2221
#define POSTDEC0                      2222
#define POSTINC0                      2223
#define INDF0                         2224
#define INTCON3                       2225
#define INT1IF                        2226
#define INT1F                         2227
#define INT2IF                        2228
#define INT2F                         2229
#define INT3F                         2230
#define INT3IF                        2231
#define INT1E                         2232
#define INT1IE                        2233
#define INT2IE                        2234
#define INT2E                         2235
#define INT3E                         2236
#define INT3IE                        2237
#define INT1P                         2238
#define INT1IP                        2239
#define INT2IP                        2240
#define INT2P                         2241
#define INTCON2                       2242
#define RBIP                          2243
#define INT3IP                        2244
#define INT3P                         2245
#define TMR0IP                        2246
#define T0IP                          2247
#define INTEDG3                       2248
#define INTEDG2                       2249
#define INTEDG1                       2250
#define INTEDG0                       2251
#define RBPU                          2252
#define NOT_RBPU                      2253
#define nRBPU                         2254
#define INTCON                        2255
#define RBIF                          2256
#define INT0F                         2257
#define INT0IF                        2258
#define T0IF                          2259
#define TMR0IF                        2260
#define RBIE                          2261
#define INT0E                         2262
#define INT0IE                        2263
#define T0IE                          2264
#define TMR0IE                        2265
#define PEIE                          2266
#define PEIE_GIEL                     2267
#define GIEL                          2268
#define GIE_GIEH                      2269
#define GIE                           2270
#define GIEH                          2271
#define PRODL                         2272
#define PRODH                         2273
#define TABLAT                        2274
#define TBLPTRL                       2275
#define TBLPTRH                       2276
#define PCL                           2277
#define PCLATH                        2278
#define PCH                           2279
#define SP0                           2280
#define STKPTR                        2281
#define SP1                           2282
#define SP2                           2283
#define SP3                           2284
#define SP4                           2285
#define STKUNF                        2286
#define STKOVF                        2287
#define STKFUL                        2288
#define TOSL                          2289
#define TOSH                          2290

#endif // _PIC18F85K90_H_
